Revit 2024 API
ViewActivatingEventArgs.NewActiveView Property
 The view that is going to become active.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public View NewActiveView { get; }
Visual Basic
Public ReadOnly Property NewActiveView As View
	Get
Visual C++
public:
property View^ NewActiveView {
	View^ get ();
}
See Also
ViewActivatingEventArgs Class
Autodesk.Revit.UI.Events Namespace